PANDAS Exercises

In [2]:
#PANDAS SERIES

In [3]:
import numpy as np
import pandas as pd

In [4]:
#Write a Python program to create and display a one-dimensional array-like object 
#containing an array of data using Pandas module.

In [5]:
ser1 = pd.Series([10,20,30,40,] , ['2015', '2016', '2017', '2018'])
ser1

2015    10
2016    20
2017    30
2018    40
dtype: int64

In [6]:
#Write a Python program to convert a Panda module Series to Python list and it's type

In [7]:
lst = list(ser1)
lst

[10, 20, 30, 40]

In [8]:
#or .tolist() method
lst2 = ser1.tolist()
lst2

[10L, 20L, 30L, 40L]

In [9]:
type(ser1.tolist())

list

In [10]:
#Write a Python program to add, subtract, multiple and divide two Pandas Series.
#Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]
ser1 = pd.Series([2, 4, 6, 8, 10])
ser2 = pd.Series([1, 3, 5, 7, 9])

In [11]:
ser_sum = ser1 + ser2
ser_sum

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [12]:
ser_substract = ser1 - ser2
ser_substract

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [13]:
ser_mult = ser1 * ser2
ser_mult

0     2
1    12
2    30
3    56
4    90
dtype: int64

In [14]:
ser_div = ser1 / ser2
ser_div

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [15]:
#PANDAS DATAFRAME

In [16]:
#Write a Python program to display the following data column wise.
#Sample data: {‘X’:[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
df1 = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

In [17]:
#Write a Python program to create and display a DataFrame from a specified dictionary data 
#which has the index labels.
#
#Sample DateFrame:
#exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
#'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
#'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
#'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
#
#labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df2 = pd.DataFrame(data= exam_data, index= labels)
df2

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [18]:
#Write a Python program to display a summary of the basic information of the previous problem
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
attempts    10 non-null int64
name        10 non-null object
qualify     10 non-null object
score       8 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [19]:
#Write a Python program to get the first 3 rows of the previous dataframe
df2[:3]  # or df2.iloc[[:3]]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

In [20]:
#Write a Python program to select the 'name' and 'score' columns from the previous DataFrame
df2[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [21]:
#Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the previous data frame.
df2.iloc[[1,3,5,6]][['name', 'score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [23]:
#Write a Python program to select the rows 
#where the number of attempts in the examination is greater than 2
df2[df2['attempts']>2]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

In [24]:
#Write a Python program to count the number of rows and columns of a DataFrame.
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
attempts    10 non-null int64
name        10 non-null object
qualify     10 non-null object
score       8 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [26]:
df2.count(axis=0)

attempts    10
name        10
qualify     10
score        8
dtype: int64

In [28]:
df2.count(axis=1)

a    4
b    4
c    4
d    3
e    4
f    4
g    4
h    3
i    4
j    4
dtype: int64

In [29]:
#Write a Python program to select the rows where the score is missing, i.e. is NaN.
df2[df2['score'].isnull()]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

In [30]:
df2['score']

a    12.5
b     9.0
c    16.5
d     NaN
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

In [31]:
df2['score'][0]

12.5

In [32]:
df2['score'][3]

nan

In [35]:
df2['score'].isnull()

a    False
b    False
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: score, dtype: bool

In [36]:
#Write a Python program to select the rows the score is between 15 and 20 (inclusive). 
df2[(df2['score']>=15) & (df2['score']<=20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

In [37]:
#Write a Python program to select the rows where number of attempts in the examination 
#is less than 2 and score greater than 15
df2[(df2['score']>15) & (df2['attempts']<2)]

   attempts   name qualify  score
j         1  Jonas     yes   19.0

In [45]:
#Write a Python program to change the score in row 'd' to 11.5
df2.loc[['d'], ['score']]=11.5
df2.loc[['d'],['score']]

   score
d   11.5

In [47]:
#Write a Python program to calculate the sum of the examination attempts by the students
df2['attempts'].sum()

19L

In [48]:
#Write a Python program to calculate the mean score for each different student in DataFrame.
df2['score'].mean()

13.333333333333334

In [50]:
# Write a Python program to append a new row 'k' to data frame with given values for each column.
#name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
df2.loc['k']=[1, 'Suresh', 'yes', 15.5] #loc can be used for appending data
df2

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0
k         1     Suresh     yes   15.5

In [51]:
#Now delete the new row and return the original DataFrame.
df2.drop('k', inplace=True)

In [52]:
df2

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [54]:
#Write a Python program to sort the DataFrame first by 'name' in descending order, 
#then by 'score' in ascending order.
df2.sort_values(by=['name','score'],ascending=[False, True])

   attempts       name qualify  score
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0
d         3      James      no   11.5
e         2      Emily      no    9.0
b         3       Dima      no    9.0
a         1  Anastasia     yes   12.5

In [61]:
df2[['qualify']]

  qualify
a     yes
b      no
c     yes
d      no
e      no
f     yes
g     yes
h      no
i      no
j     yes

In [65]:
df2['qualify'].map({'yes': True , 'no': False})

a     True
b    False
c     True
d    False
e    False
f     True
g     True
h    False
i    False
j     True
Name: qualify, dtype: bool

In [66]:
df2['qualify']=df2['qualify'].map({'yes':True , 'no':False})

In [67]:
df2

   attempts       name  qualify  score
a         1  Anastasia     True   12.5
b         3       Dima    False    9.0
c         2  Katherine     True   16.5
d         3      James    False   11.5
e         2      Emily    False    9.0
f         3    Michael     True   20.0
g         1    Matthew     True   14.5
h         1      Laura    False    NaN
i         2      Kevin    False    8.0
j         1      Jonas     True   19.0

In [71]:
#Write a Python program to change the name 'James' to 'Suresh' in name column of the DataFrame
df2[df2['name']=='James']

   attempts   name  qualify  score
d         3  James    False   11.5

In [79]:
df2['name'].replace('James','Suresh') #inplace for permanently

a    Anastasia
b         Dima
c    Katherine
d       Suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object

In [81]:
#Write a Python program to delete the 'attempts' column from the DataFrame
df2.drop('attempts', axis=1)

        name  qualify  score
a  Anastasia     True   12.5
b       Dima    False    9.0
c  Katherine     True   16.5
d      James    False   11.5
e      Emily    False    9.0
f    Michael     True   20.0
g    Matthew     True   14.5
h      Laura    False    NaN
i      Kevin    False    8.0
j      Jonas     True   19.0

In [83]:
#or pop() method for permanently
df2.pop('attempts')

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64

In [84]:
df2

        name  qualify  score
a  Anastasia     True   12.5
b       Dima    False    9.0
c  Katherine     True   16.5
d      James    False   11.5
e      Emily    False    9.0
f    Michael     True   20.0
g    Matthew     True   14.5
h      Laura    False    NaN
i      Kevin    False    8.0
j      Jonas     True   19.0

In [88]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [90]:
df3 = pd.DataFrame(exam_data, labels)

In [91]:
df3

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [92]:
#Write a Python program to insert a new column in existing DataFrame.
#Insert the following column:
#color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df3['color'] = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']

In [93]:
df3

   attempts       name qualify  score   color
a         1  Anastasia     yes   12.5     Red
b         3       Dima      no    9.0    Blue
c         2  Katherine     yes   16.5  Orange
d         3      James      no    NaN     Red
e         2      Emily      no    9.0   White
f         3    Michael     yes   20.0   White
g         1    Matthew     yes   14.5    Blue
h         1      Laura      no    NaN   Green
i         2      Kevin      no    8.0   Green
j         1      Jonas     yes   19.0     Red

In [98]:
#Write a Python program to get list from DataFrame column headers
df3.columns.values

array(['attempts', 'name', 'qualify', 'score', 'color'], dtype=object)

In [101]:
#APPLY METHOD
df3['score'].apply(lambda x: x*2)

a    25.0
b    18.0
c    33.0
d     NaN
e    18.0
f    40.0
g    29.0
h     NaN
i    16.0
j    38.0
Name: score, dtype: float64

In [102]:
df3

   attempts       name qualify  score   color
a         1  Anastasia     yes   12.5     Red
b         3       Dima      no    9.0    Blue
c         2  Katherine     yes   16.5  Orange
d         3      James      no    NaN     Red
e         2      Emily      no    9.0   White
f         3    Michael     yes   20.0   White
g         1    Matthew     yes   14.5    Blue
h         1      Laura      no    NaN   Green
i         2      Kevin      no    8.0   Green
j         1      Jonas     yes   19.0     Red